In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from IPython import display #Markdown'da resim gösterebilmek için
%matplotlib inline
##################################


# sonuçlarda çıkan warning'leri ignore etmek için;
from warnings import filterwarnings
filterwarnings("ignore")
##################################


#dataframe'deki değerlerin 3 basamaklı float formunda gösterilmesi için;
from IPython.display import display
pd.options.display.float_format = '{:.3f}'.format
##################################

# Pandas Kodları

## Data Import

### read_csv()

#### Çalışma Klasöründen

In [2]:
# Çalışma klasöründeki dosyayı çağırabilirsin
df = pd.read_csv("train.csv")

#### Büyük Boyutlu Verilerde Kısa Sürede Import
* Öncelikle şunu söylemeliyim ki verileri "csv" dosyası yapıp import edersen diğer dosya türlerine göre daha az zaman harcarsın  

* Bununla birlikte verileri import ederken "chunk" yöntemi kullanmak da diğer bir kolay yöntemdir. Aşağıda nasıl yapıldığı gösterilmiştir.

In [ ]:
mylist = []

# Verinin büyüklüğüne göre chunksize parametresini değiştirebilirsin. 
# Chunksize veriyi kaç satırlık parçalara böleceğini gösterir
for chunk in pd.read_csv('train.csv',chunksize=100, sep=";"):
    mylist.append(chunk)
    
df = pd.concat(mylist, axis= 0)
del mylist

#### Bilgisayardaki Herhangi Bir Klasörden

In [4]:
# PC'nizdeki bir dosyanın linkini girerek de dosyayı import edebilirsin
# Dosyanın bulunduğu path'in önüne "r" harfini koymalısın.
df = pd.read_csv(r"C:\Users\musta\Desktop\ds_MB\train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000,1,0,A/5 21171,7.250,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000,1,0,PC 17599,71.283,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000,1,0,113803,53.100,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000,0,0,373450,8.050,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000,0,0,211536,13.000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000,0,0,112053,30.000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.450,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000,0,0,111369,30.000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000,0,0,370376,7.750,NaN,Q

#### URL Aracılığıyla CSV Dosyası Alma

In [5]:
dfurl = pd.read_csv(
    "https://raw.githubusercontent.com/mustafabirdal/GlobalAIHubMachineLearningCourse/main/Final%20Project/diamonds.csv")
dfurl

,index,carat,cut,color,clarity,depth,table,x,y,z,price
0,1,0.230,Ideal,E,SI2,61.500,55.000,3.950,3.980,2.430,Very Low
1,2,0.210,Premium,E,SI1,59.800,61.000,3.890,3.840,2.310,Very Low
2,3,0.230,Good,E,VS1,56.900,65.000,4.050,4.070,2.310,Very Low
3,4,0.290,Premium,I,VS2,62.400,58.000,4.200,4.230,2.630,Very Low
4,5,0.310,Good,J,SI2,63.300,58.000,4.340,4.350,2.750,Very Low
...,...,...,...,...,...,...,...,...,...,...,...
53935,53936,0.720,Ideal,D,SI1,60.800,57.000,5.750,5.760,3.500,Very Low
53936,53937,0.720,Good,D,SI1,63.100,55.000,5.690,5.750,3.610,Very Low
53937,53938,0.700,Very Good,D,SI1,62.800,60.000,5.660,5.680,3.560,Very Low
53938,53939,0.860,Premium,H,SI2,61.000,58.000,6.150,6.120,3.740,Very Low
53939,53940,0.750,Ideal,D,SI2,62.200,55.000,5.830,5.870,3.640,Very Low

#### Sadece İstenen Kolonların Alınması

In [6]:
dfc = pd.read_csv("train.csv",usecols=["Embarked","Survived"])
dfc

     Survived Embarked
0           0        S
1           1        C
2           1        S
3           1        S
4           0        S
..        ...      ...
886         0        S
887         1        S
888         0        S
889         1        C
890         0        Q

[891 rows x 2 columns]

### pd.read_html()
* Bu kod ile bir URL'de bulunan herhangi bir tabloyu alabiliyorsun.  


* **URL'de birden çok tablo varsa, sadece almak istediğiniz tabloda olan bir kolon ismini "match" argümanının yanına yazarak istediğin tabloyu import edebilirsin.**

In [7]:
dfhtml = pd.read_html("https://en.wikipedia.org/wiki/Economy_of_the_United_States#Road",match="Nominal GDP")

#dfhtml nesnesi bir list olarak geri döndürülecektir. Onu bir dataframe yapmak için;
dfhtml[0]

,Year,Nominal GDP(billions USD),GDP per capita(USD),GDP growth(real),Inflation rate(in %),Unemployment(in %),Budget balance(in % of GDP)[116],Government debt held by public(in % of GDP)[117],Current accountbalance(in % of GDP)
0,2020 (est),20934.000,57589,−3.5 %,0.62 %,11.1 %,−n/a %,79.9 %,−n/a %
1,2019,21439.000,64674,2.2 %,1.8 %,3.5 %,−4.6 %,78.9 %,NaN
2,2018,20611.200,62869,3.0 %,2.4 %,3.9 %,−3.8 %,77.8 %,−2.4 %
3,2017,19519.400,60000,2.3%,2.1 %,4.4 %,−3.4 %,76.1%,−2.3 %
4,2016,18715.000,57878,1.7 %,1.3 %,4.9 %,−3.1 %,76.4%,−2.3 %
5,2015,18224.800,56770,3.1 %,0.1 %,5.3 %,−2.4 %,72.5%,−2.2 %
6,2014,17521.300,54993,2.5 %,1.6 %,6.2 %,−2.8 %,73.7%,−2.1 %
7,2013,16784.900,52737,1.8 %,1.5 %,7.4 %,−4.0 %,72.2%,−2.1 %
8,2012,16155.300,51404,2.2 %,2.1 %,8.1 %,−5.7 %,70.3%,−2.6 %
9,2011,15517.900,49736,1.6 %,3.1 %,8.9 %,−7.3 %,65.8%,−2.9 %
10,2010,14964.400,48311,2.6 %,1.6 %,9.6 %,−8.6 %,60.8%,−2.9 %
11,2009,14418.700,46909,−2.5 %,−0.3 %,9.3 %,−9.8 %,52.3%,−2.6 %
12,2008,14718.600,48302,−0.2 %,3.8 %,5.8 %,−4.6 %,39.4%,−4.6 %
13,2007,14477.600,47955,1.9 %,2.9 %,4.6 %,−0.8 %,35.2%,−4.9 %
14,2006,13855.900,46352,2.9 %,3.2 %,4.6 %,−0.1 %,35.4%,−5.8 %
15,2005,13093.700,44218,3.3 %,3.4 %,5.1 %,−1.2 %,35.8%,−5.7 %
16,2004,12274.900,41838,3.8 %,2.7 %,5.5 %,−2.3 %,35.7%,−5.1 %
17,2003,11510.700,39592,2.8 %,2.3 %,6.0 %,−2.8 %,34.7%,−4.1 %
18,2002,10977.500,38114,1.8 %,1.6 %,5.8 %,−1.7 %,32.7%,−4.1 %
19,2001,10621.900,37241,1.0 %,2.8 %,4.7 %,1.2 %,31.5%,−3.7 %
20,2000,10284.800,36433,4.1 %,3.4 %,4.0 %,2.3 %,33.7%,−3.9 %
21,1999,9660.600,34602,4.8 %,2.2 %,4.2 %,1.3 %,38.3%,−3.0 %
22,1998,9089.200,32929,4.5 %,1.5 %,4.5 %,0.8 %,41.7%,−2.4 %
23,1997,8608.500,31554,4.4 %,2.3 %,4.9 %,−0.2 %,44.6%,−1.6 %
24,1996,8100.100,30047,3.7 %,2.9 %,5.4 %,−1.3 %,47.0%,−1.5 %
25,1995,7664.100,28763,2.7 %,2.8 %,5.6 %,−2.1 %,47.7%,−1.5 %
26,1994,7308.800,27756,4.0 %,2.6 %,6.1 %,−2.8 %,47.8%,−1.7 %
27,1993,6878.700,26442,2.7 %,3.0 %,6.9 %,−3.7 %,47.9%,−1.2 %
28,1992,6539.300,25467,3.6 %,3.0 %,7.5 %,−4.5 %,46.8%,−0.8 %
29,1991,6174.100,24366,−0.1 %,4.2 %,6.9 %,−4.4 %,44.1%,0.0 %
30,1990,5979.600,23914,1.9 %,5.4 %,5.6 %,−3.7 %,40.9%,−1.3 %
31,1989,5657.700,22879,3.7 %,4.8 %,5.3 %,−2.7 %,39.4%,−1.8 %
32,1988,5252.600,21442,4.2 %,4.1 %,5.5 %,−3.0 %,39.9%,−2.3 %
33,1987,4870.200,20063,3.5 %,3.6 %,6.2 %,−3.1 %,39.6%,−3.3 %
34,1986,4590.100,19078,3.5 %,1.9 %,7.0 %,−4.8 %,38.5%,−3.2 %
35,1985,4346.800,18232,4.2 %,3.5 %,7.2 %,−4.9 %,35.3%,−2.7 %
36,1984,4040.700,17099,7.2 %,4.4 %,7.5 %,−4.6 %,33.1%,−2.3 %
37,1983,3638.100,15531,4.6 %,3.2 %,9.6 %,−5.7 %,32.2%,−1.1 %
38,1982,3345.000,14410,−1.8 %,6.2 %,9.7 %,−3.8 %,27.9%,−0.2 %
39,1981,3211.000,13966,2.6 %,10.4 %,7.6 %,−2.5 %,25.2%,0.2 %
40,1980,2862.500,12575,−0.2 %,13.5 %,7.2 %,−2.6 %,25.5%,0.1 %

In [8]:
# Bir başka örnek;
dfnba = pd.read_html("https://www.basketball-reference.com/",match="East")
dfnba[0]

        East Unnamed: 1 Unnamed: 2   W   L
0    WAS (1)          F          $   9   3
1    BRK (2)          F          $  10   4
2    CHI (3)          F          $   9   4
3    CLE (4)          F          $   9   5
4    MIA (5)          F          $   8   5
5    PHI (6)          F          $   8   6
6    NYK (7)          F          $   7   6
7    CHO (8)          F          $   8   7
8    TOR (9)          F          $   7   7
9   BOS (10)          F          $   6   7
10  MIL (11)          F          $   6   8
11  IND (12)          F          $   6   8
12  ATL (13)          F          $   5   9
13  DET (14)          F          $   3   9
14  ORL (15)          F          $   3  10

### pd.read_excel()
* sadece excel dosyasının ismini veya dosya konumunu veya linkini yaz yeterli

In [ ]:
dfex = pd.read_excel("titanic.xlsx")

### SQL database'den import etmek;

* Bu bölümdeki kodları çalıştırmadık, çünkü herhangi bir sql database'imiz yok.

In [ ]:
# Önce aşağıdaki "pysqlite3" isimli library yüklenmeli ve import edilmeli.

#!pip install pysqlite3

#import sqlite3

In [ ]:
'''
con = sqlite3.connect("database.db")

df = pd.read_sql_query("SELECT * FROM purchases", con)

df
'''

## EDA'da Kullanılan BASİT Kodlar

### shape

* Dataframe'in boyutlarını verir.

In [142]:
df = pd.read_csv("train.csv")
df.shape

(891, 12)

### columns ve values

* **columns:** Dataframe'deki kolon isimlerini döndürür.  


* **values:** Dataframe'deki değerleri döndürür. Dataframe'in hepsi için kullanıldığı gibi sadece bir veya birkaç kolon özelinde de kullanılabilir.

In [9]:
df = pd.read_csv("train.csv")

In [10]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [11]:
df.values

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [889, 0, 3, ..., 23.45, nan, 'S'],
       [890, 1, 1, ..., 30.0, 'C148', 'C'],
       [891, 0, 3, ..., 7.75, nan, 'Q']], dtype=object)

### duplicated ve drop_dupilcates

#### duplicated()

* Herhangi bir gözlemden birden fazla varsa True döndürür.  


* Fonksiyonun ***any()*** fonksiyonu ile kombine edilmesiyle de tüm dataframe'de veya incelenen kolon/kolonlarda genel anlamda herhangi bir duplicated gözlem olup olmadığı sorusuna cevap alınabilir.


* Dataframe'in tümü için kullanılabildiği gibi sadece bir veya birkaç kolon özelinde de kullanılabilir. Kolon belirtmek için fonksiyonun "subset=" parametresi kullanılır.  


* Bu fonksiyon default olarak tekrarlayan gözlemlerin hepsini değil sadece tekrar edenleri ekrana getirir. Bunun yerine tümünü ekrana getirebilmek için fonksiyonun (keep= False) parametresinden yararlanılır.

In [12]:
df = pd.read_csv("train.csv")

In [17]:
df.duplicated().any()

False

In [15]:
df.duplicated(subset=["Name"], keep=False)

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

#### drop_duplicates()

* Eğer duplicated veri varsa aşağıdaki kod kullanılarak duplicated verileri DataFrame'den silebiliriz.


* Inplace = True, bu parametreyle işlemini kalıcı hale getirirsiniz.  


* ignore_index = True, bu parametreyle silinen gözlemin oluşturduğu index sayısındaki eksiklik önemsenmez ve indexler tekrardan 0'dan başlayacak şekilde dağıtılır.

In [16]:
df.drop_duplicates(inplace=True, ignore_index=True)

### info()

* Dataframe'deki kolonlar hakkında genel bilgiler verir. Kolonlardaki gözlemlerin veri tipi ve eksik veriler basitçe tespit edilebilir.

In [18]:
df = pd.read_csv("train.csv")

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### describe()

* Dataframe'deki kolonlar hakkında genel istatistik bilgiler verir.


* Tüm dataframe için kullanılabildiği gibi sadece bir veya birkaç kolon özelinde de kullanılabilir.  


* Default olarak nümerik kolonlara ait istatistik bilgiler ekrana gelecektir. Ancak istenildiği taktirde fonksiyonun ***'include="all"'*** parametresiyle hem nümerik hem kategorik değişkenlere ait istatistik bilgiler görüntülenebilir. Hatta ***'include="O"'*** parametresiyle sadece kategorik değişkenlere ait istatistikler görüntülenebilir.

In [20]:
df = pd.read_csv("train.csv")

In [21]:
df.describe()

       PassengerId  Survived  Pclass     Age   SibSp   Parch    Fare
count      891.000   891.000 891.000 714.000 891.000 891.000 891.000
mean       446.000     0.384   2.309  29.699   0.523   0.382  32.204
std        257.354     0.487   0.836  14.526   1.103   0.806  49.693
min          1.000     0.000   1.000   0.420   0.000   0.000   0.000
25%        223.500     0.000   2.000  20.125   0.000   0.000   7.910
50%        446.000     0.000   3.000  28.000   0.000   0.000  14.454
75%        668.500     1.000   3.000  38.000   1.000   0.000  31.000
max        891.000     1.000   3.000  80.000   8.000   6.000 512.329

In [22]:
# "T" fonksiyonu kullanılarak görsellik değiştirilebilir
df.describe().T

              count    mean     std   min     25%     50%     75%     max
PassengerId 891.000 446.000 257.354 1.000 223.500 446.000 668.500 891.000
Survived    891.000   0.384   0.487 0.000   0.000   0.000   1.000   1.000
Pclass      891.000   2.309   0.836 1.000   2.000   3.000   3.000   3.000
Age         714.000  29.699  14.526 0.420  20.125  28.000  38.000  80.000
SibSp       891.000   0.523   1.103 0.000   0.000   0.000   1.000   8.000
Parch       891.000   0.382   0.806 0.000   0.000   0.000   0.000   6.000
Fare        891.000  32.204  49.693 0.000   7.910  14.454  31.000 512.329

In [25]:
df.describe(include="all")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000,891.000,891.000,891,891,714.000,891.000,891.000,891,891.000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",male,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000,0.384,2.309,NaN,NaN,29.699,0.523,0.382,NaN,32.204,NaN,NaN
std,257.354,0.487,0.836,NaN,NaN,14.526,1.103,0.806,NaN,49.693,NaN,NaN
min,1.000,0.000,1.000,NaN,NaN,0.420,0.000,0.000,NaN,0.000,NaN,NaN
25%,223.500,0.000,2.000,NaN,NaN,20.125,0.000,0.000,NaN,7.910,NaN,NaN
50%,446.000,0.000,3.000,NaN,NaN,28.000,0.000,0.000,NaN,14.454,NaN,NaN
75%,668.500,1.000,3.000,NaN,NaN,38.000,1.000,0.000,NaN,31.000,NaN,NaN
max,891.000,1.000,3.000,NaN,NaN,80.000,8.000,6.000,NaN,512.329,NaN,NaN

In [24]:
df.describe(include="O")

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [26]:
df.Age.describe().T

count   714.000
mean     29.699
std      14.526
min       0.420
25%      20.125
50%      28.000
75%      38.000
max      80.000
Name: Age, dtype: float64

### unique ve nunique

* **unique =** Bir değişkendeki her bir farklı elemanlanın listesini getirir.  


* **nunique =** Değişkendeki unique elemanların sayısını verir.

In [27]:
df.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [28]:
df.Embarked.nunique()

3

### value_counts()

* Bir değişkendeki farklı değerlerin frekans sayılarını verir. 


* **normalize=True**, bu parametreyle değerlerin frekansları yüzdesel şekilde verilir.


* **ascending=True**, bu parametreyle frekans sayıları büyükten küçüğe değil küçükten büyüğe olacak şekilde görüntülenir.


* **dropna=False**, bu parametreyle default olarak hesaba katılmayan Nan değerler de hesaba katılır ve onların da kaç tane olduğu görüntülenir.


* **bins=Integer**, bu parametreyle nümerik veriler incelenirken verinin kaç parçaya bölüneceği girilir ve bölünmüş parçalarda kaç adet gözlem bulunduğu görüntülenir.

In [29]:
df = pd.read_csv("train.csv")

In [33]:
df.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [32]:
df.Embarked.value_counts(normalize=True)

S   0.724
C   0.189
Q   0.087
Name: Embarked, dtype: float64

In [35]:
df.Embarked.value_counts(ascending=True)

Q     77
C    168
S    644
Name: Embarked, dtype: int64

In [36]:
df.Embarked.value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

In [37]:
df.Age.value_counts(bins=5)

(16.336, 32.252]    346
(32.252, 48.168]    188
(0.339, 16.336]     100
(48.168, 64.084]     69
(64.084, 80.0]       11
Name: Age, dtype: int64

### sort_values()

* Bir değişkendeki değerlerin büyükten küçüğe, küçükten büyüğe veya alfabetik sırada dizilmesini sağlar.


* **inplace=True**, bu parametreyle sıralama kalıcı olarak değişkende kaydedilebilir.  


* **ascending=False**, fonksiyon default olarak küçükten büyüğe sıralama yapar veya alfabetik olarak a'dan z'ye, ancak bu parametre bu şekilde kullanılırsa tam tersi şekilde sıralamayı yapacaktır.  


* **na_position="first"**, bu parametre default olarak sıralamada en sona atılan Nan gözlemleri en başta göstermeye yarayacaktır.  


* **ignore_index=True**, bu parametreyle index'ler tekrardan sıralanmış bir şekilde gösterilecektir.

In [40]:
df.Age.sort_values()

803   0.420
755   0.670
644   0.750
469   0.750
78    0.830
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: Age, Length: 891, dtype: float64

In [41]:
df.Age.sort_values(ascending=False)

630   80.000
851   74.000
493   71.000
96    71.000
116   70.500
       ...
859      NaN
863      NaN
868      NaN
878      NaN
888      NaN
Name: Age, Length: 891, dtype: float64

In [42]:
df.Age.sort_values(na_position="first", ignore_index=True)

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
       ...
886   70.500
887   71.000
888   71.000
889   74.000
890   80.000
Name: Age, Length: 891, dtype: float64

### any()

* Belirtilen koşulu sağlayan en az bir gözlem varsa **TRUE** döndürür.

In [45]:
df = pd.read_csv("train.csv")

In [46]:
df["Pclass"][df.Pclass==3].any()

True

In [47]:
df["Pclass"][df.Pclass==33].any()

False

### isin()

* Fonksiyonda belirtilen şey değişkende varsa **True** döndürür.

In [48]:
df = pd.read_csv("train.csv")

In [49]:
df["Sex"].isin(["male"])

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: Sex, Length: 891, dtype: bool

### isna(), isnull(), notna(), notnull()

* **isna() ve isnull():** Dataframe'in tamamında veya belirtilen bir değişkendeki Nan gözlemleri True olarak döndürür. Çeşitli matematiksel ve conditional fonksiyonlarla kullanılarak Nan verilerin varlığı hakkında daha düenli bilgiler alınabilir.  


* **notna() ve notnull():** isna() ve isnull() aksine Dataframe'in tamamında veya belirtilen bir değişkende Nan olmayan gözlemleri True olarak döndürür.

In [133]:
df = pd.read_csv("train.csv")

In [134]:
df.isna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [138]:
df.isna().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [135]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [136]:
df.isna().mean()

PassengerId   0.000
Survived      0.000
Pclass        0.000
Name          0.000
Sex           0.000
Age           0.199
SibSp         0.000
Parch         0.000
Ticket        0.000
Fare          0.000
Cabin         0.771
Embarked      0.002
dtype: float64

In [137]:
df.notnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,True,True,True,True,True,True,True,True,True,True,False,True
1,True,True,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,True,False,True
3,True,True,True,True,True,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True,True,True,True,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...
886,True,True,True,True,True,True,True,True,True,True,False,True
887,True,True,True,True,True,True,True,True,True,True,True,True
888,True,True,True,True,True,False,True,True,True,True,False,True
889,True,True,True,True,True,True,True,True,True,True,True,True
890,True,True,True,True,True,True,True,True,True,True,False,True

In [139]:
df.Age.notnull().sum()

714

In [141]:
df.notnull().mean()

PassengerId   1.000
Survived      1.000
Pclass        1.000
Name          1.000
Sex           1.000
Age           0.801
SibSp         1.000
Parch         1.000
Ticket        1.000
Fare          1.000
Cabin         0.229
Embarked      0.998
dtype: float64

### to_frame() - Kolayca DataFrame yapma
* Bazen dataframe'den elde ettiğimiz bir nesneyi de DataFrame olarak kullanmak isteriz.  


* Mesela value_counts() ile bir dataframe'deki belli bir kolonda bulunan unique elemanların sayısını elde edersin. Ama eleman sayılarını gösteren liste sana bir dataframe olarak döndürülmez. Ama sen eğer bunu da dataframe olarak kullanmak istersen to_frame kodu imdadına yetişiyor.  


* Çok kullanışlı bir kod, herhangi bir şeye kullanabilirsin.

In [50]:
df = pd.read_csv("train.csv")

In [51]:
df.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [52]:
df.Embarked.value_counts().to_frame()

   Embarked
S       644
C       168
Q        77

### to_dict()

* to_frame()'in çalışma prensibinde olduğu gibi bu kodla nesneleri dictionary formatına çevirebiliriz.

In [53]:
df = pd.read_csv("train.csv")
df.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [54]:
df.Embarked.value_counts().to_dict()

{'S': 644, 'C': 168, 'Q': 77}

## QUERY(Sorgu) Kodları - DataFrame'de Slicing Yapma/İstenilen Verileri Arama

### head ve tail

* **head =** index sırasına göre en üstteki belirtilen sayıdaki veriyi gösterir.  


* **tail =** index sırasına göre en alttaki belirtilen sayıdaki veriyi gösterir.

In [58]:
df = pd.read_csv("train.csv")

In [59]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000,1,0,A/5 21171,7.250,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000,1,0,PC 17599,71.283,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000,0,0,STON/O2. 3101282,7.925,NaN,S

In [60]:
df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.450,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000,0,0,111369,30.000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000,0,0,370376,7.750,NaN,Q

### nlargest ve nsmallest

* Bir nümerik değişkendeki belirtilen sayıdaki en büyük ve en küçük değerlerin görüntülenmesi için kullanılırlar. 


* Kategorik değişkenlerde çalışmıyorlar.


* **keep="all"**, bu parametre kullanılarak duplicate etmiş gözlemlerin hepsinin görüntülenmesi sağlanır. Default ayarlarda sadece ilkini gösterecektir.

In [61]:
df = pd.read_csv("train.csv")

In [65]:
df.Age.nlargest(5, keep="all")

630   80.000
851   74.000
96    71.000
493   71.000
116   70.500
Name: Age, dtype: float64

In [66]:
df.Age.nsmallest(5, keep="all")

803   0.420
755   0.670
469   0.750
644   0.750
78    0.830
831   0.830
Name: Age, dtype: float64

### Conditional Slicing

In [55]:
df = pd.read_csv("train.csv")

In [56]:
df[(df.Age >= 70) & (df["Sex"]=="male")]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.000,0,0,PC 17754,34.654,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.500,0,0,370369,7.750,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.000,0,0,PC 17609,49.504,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.000,0,0,27042,30.000,A23,S
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.000,0,0,C.A. 24580,10.500,NaN,S
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.000,1,1,WE/P 5735,71.000,B22,S
851,852,0,3,"Svensson, Mr. Johan",male,74.000,0,0,347060,7.775,NaN,S

In [57]:
# Tilda kullanarak
df[~((df.Age >= 70) & (df["Sex"]=="male"))]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000,1,0,A/5 21171,7.250,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000,1,0,PC 17599,71.283,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000,1,0,113803,53.100,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000,0,0,373450,8.050,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000,0,0,211536,13.000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000,0,0,112053,30.000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.450,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000,0,0,111369,30.000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000,0,0,370376,7.750,NaN,Q

### loc

* Köşeli parantezin içine ilk olarak bakmak istediğin verilerin index numaralarını veya aralıklarını giriyorsun, daha sonra bir virgül koyup string olarak hangi kolonu incelemek istediğini yazıyorsun.  


* Eğer kolon bilgisi girmezsen sana tüm kolonlara göre belirtilen index/indexlerdeki gözlemleri döndürecektir.


* Son olarak çift köşeli parantez içinde random şekilde index numaralarını verirsen direkt o gözlemleri görüntüleyebilirsin.  


* loc fonksiyonunun en önemli özelliği ise girilen index değerlerinin string olması durumunda da string girdi alarak sonu ulaşabilmesidir.

In [67]:
df = pd.read_csv("train.csv")

In [75]:
df.loc[2]

PassengerId                         3
Survived                            1
Pclass                              3
Name           Heikkinen, Miss. Laina
Sex                            female
Age                            26.000
SibSp                               0
Parch                               0
Ticket               STON/O2. 3101282
Fare                            7.925
Cabin                             NaN
Embarked                            S
Name: 2, dtype: object

In [74]:
df.loc[2:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000,1,0,113803,53.100,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000,0,0,373450,8.050,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.458,NaN,Q

In [76]:
df.loc[2:10:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000,0,0,STON/O2. 3101282,7.925,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000,0,0,373450,8.050,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.000,0,0,17463,51.862,E46,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.000,0,2,347742,11.133,NaN,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.000,1,1,PP 9549,16.700,G6,S

In [77]:
df.loc[2:5,"Age"]

2   26.000
3   35.000
4   35.000
5      NaN
Name: Age, dtype: float64

In [84]:
df.loc[2:5,"Age":"Fare"]

     Age  SibSp  Parch            Ticket   Fare
2 26.000      0      0  STON/O2. 3101282  7.925
3 35.000      1      0            113803 53.100
4 35.000      0      0            373450  8.050
5    NaN      0      0            330877  8.458

In [87]:
df.loc[[5,100,59]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.458,NaN,Q
100,101,0,3,"Petranec, Miss. Matilda",female,28.000,0,0,349245,7.896,NaN,S
59,60,0,3,"Goodwin, Master. William Frederick",male,11.000,5,2,CA 2144,46.900,NaN,S

In [95]:
df.loc[[5,100,59],"Age":"Fare"]

       Age  SibSp  Parch   Ticket   Fare
5      NaN      0      0   330877  8.458
100 28.000      0      0   349245  7.896
59  11.000      5      2  CA 2144 46.900

### iloc

* loc fonksiyonuna çok benziyor, tek farkı kolon bilgisi girmek istediğinde o kolonun sıra numarasını girmen gerekir.  


* Çift köşeli parantez içinde random şekilde index numaralarını verirsen direkt o gözlemleri görüntüleyebilirsin.


* Index değerlerinin string olması durumunda iloc fonksiyonu çalışmayacaktır. iloc sadece nümerik değerlerin girilmesini kabul eder.

In [80]:
df.iloc[2:5, 3:7]

                                           Name     Sex    Age  SibSp
2                        Heikkinen, Miss. Laina  female 26.000      0
3  Futrelle, Mrs. Jacques Heath (Lily May Peel)  female 35.000      1
4                      Allen, Mr. William Henry    male 35.000      0

In [94]:
df.iloc[[5,100,59],3:6]

                                   Name     Sex    Age
5                      Moran, Mr. James    male    NaN
100             Petranec, Miss. Matilda  female 28.000
59   Goodwin, Master. William Frederick    male 11.000

#### Verilen Bir Index Listesindeki Elemanları Bulma

In [98]:
df.iloc[df[(df.Age<30)&(df.Pclass == 1)].index.to_list(),:]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
23,24,1,1,"Sloper, Mr. William Thompson",male,28.000,0,0,113788,35.500,A6,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.000,3,2,19950,263.000,C23 C25 C27,S
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.000,1,0,PC 17604,82.171,NaN,C
83,84,0,1,"Carrau, Mr. Francisco M",male,28.000,0,0,113059,47.100,NaN,S
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.000,3,2,19950,263.000,C23 C25 C27,S
97,98,1,1,"Greenfield, Mr. William Bertram",male,23.000,0,1,PC 17759,63.358,D10 D12,C
102,103,0,1,"White, Mr. Richard Frasar",male,21.000,0,1,35281,77.287,D26,S
118,119,0,1,"Baxter, Mr. Quigg Edmond",male,24.000,0,1,PC 17558,247.521,B58 B60,C
136,137,1,1,"Newsom, Miss. Helen Monypeny",female,19.000,0,2,11752,26.283,D47,S
139,140,0,1,"Giglio, Mr. Victor",male,24.000,0,0,PC 17593,79.200,B86,C
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.000,1,0,113776,66.600,C2,S
290,291,1,1,"Barber, Miss. Ellen ""Nellie""",female,26.000,0,0,19877,78.850,NaN,S
291,292,1,1,"Bishop, Mrs. Dickinson H (Helen Walton)",female,19.000,1,0,11967,91.079,B49,C
297,298,0,1,"Allison, Miss. Helen Loraine",female,2.000,1,2,113781,151.550,C22 C26,S
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.920,1,2,113781,151.550,C22 C26,S
307,308,1,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.000,1,0,PC 17758,108.900,C65,C
310,311,1,1,"Hays, Miss. Margaret Bechstein",female,24.000,0,0,11767,83.158,C54,C
311,312,1,1,"Ryerson, Miss. Emily Borie",female,18.000,2,2,PC 17608,262.375,B57 B59 B63 B66,C
329,330,1,1,"Hippach, Miss. Jean Gertrude",female,16.000,0,1,111361,57.979,B18,C
336,337,0,1,"Pears, Mr. Thomas Clinton",male,29.000,1,0,113776,66.600,C2,S
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.000,3,2,19950,263.000,C23 C25 C27,S
356,357,1,1,"Bowerman, Miss. Elsie Edith",female,22.000,0,1,113505,55.000,E33,S
369,370,1,1,"Aubart, Mme. Leontine Pauline",female,24.000,0,0,PC 17477,69.300,B35,C
370,371,1,1,"Harder, Mr. George Achilles",male,25.000,1,0,11765,55.442,E50,C
373,374,0,1,"Ringhini, Mr. Sante",male,22.000,0,0,PC 17760,135.633,NaN,C
377,378,0,1,"Widener, Mr. Harry Elkins",male,27.000,0,2,113503,211.500,C82,C
393,394,1,1,"Newell, Miss. Marjorie",female,23.000,1,0,35273,113.275,D36,C
430,431,1,1,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",male,28.000,0,0,110564,26.550,C52,S
435,436,1,1,"Carter, Miss. Lucile Polk",female,14.000,1,2,113760,120.000,B96 B98,S
445,446,1,1,"Dodge, Master. Washington",male,4.000,0,2,33638,81.858,A34,S
484,485,1,1,"Bishop, Mr. Dickinson H",male,25.000,1,0,11967,91.079,B49,C
498,499,0,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.000,1,2,113781,151.550,C22 C26,S
504,505,1,1,"Maioni, Miss. Roberta",female,16.000,0,0,110152,86.500,B79,S
505,506,0,1,"Penasco y Castellana, Mr. Victor de Satode",male,18.000,1,0,PC 17758,108.900,C65,C
539,540,1,1,"Frolicher, Miss. Hedwig Margaritha",female,22.000,0,2,13568,49.500,B39,C
550,551,1,1,"Thayer, Mr. John Borland Jr",male,17.000,0,2,17421,110.883,C70,C
585,586,1,1,"Taussig, Miss. Ruth",female,18.000,0,2,110413,79.650,E68,S
607,608,1,1,"Daniel, Mr. Robert Williams",male,27.000,0,0,113804,30.500,NaN,S
627,628,1,1,"Longley, Miss. Gretchen Fiske",female,21.000,0,0,13502,77.958,D9,S
641,642,1,1,"Sagesser, Mlle. Emma",female,24.000,0,0,PC 17477,69.300,B35,C
681,682,1,1,"Hassab, Mr. Hammad",male,27.000,0,0,PC 17572,76.729,D49,C
689,690,1,1,"Madill, Miss. Georgette Alexandra",female,15.000,0,1,24160,211.338,B5,S
700,701,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.000,1,0,PC 17757,227.525,C62 C64,C
708,709,1,1,"Cleaver, Miss. Alice",female,22.000,0,0,113781,151.550,NaN,S
710,711,1,1,"Mayne, Mlle. Berthe Antonine (""Mrs de Villiers"")",female,24.000,0,0,PC 17482,49.504,C90,C
724,725,1,1,"Chambers, Mr. Norman Campbell",male,27.000,1,0,113806,53.100,E8,S
730,731,1,1,"Allen, Miss. Elisabeth Walton",female,29.000,0,0,24160,211.338,B5,S
742,743,1,1,"Ryerson, Miss. Susan Parker ""Suzette""",female,21.000,2,2,PC 17608,262.375,B57 B59 B63 B66,C
748,749,0,1,"Marvin, Mr. Daniel Warner",male,19.000,1,0,113773,53.100,D30,S
781,782,1,1,"Dick, Mrs. Albert Adrian (Vera Gillespie)",female,17.000,1,0,17474,57.000,B20,S
782,783,0,1,"Long, Mr. Milton Clyde",male,29.000,0,0,113501,30.000,D6,S
802,803,1,1,"Carter, Master. William Thornton II",male,11.000,1,2,113760,120.000,B96 B98,S
853,854,1,1,"Lines, Miss. Mary Conover",female,16.000,0,1,PC 17592,39.400,D28,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000,0,0,112053,30.000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000,0,0,111369,30.000,C148,C

### between()

* between süper bir fonksiyon. Normalde bu fonksiyonun yaptığı şeyi conditional şekilde yazsak uzunca bir kod yazmak gerekirdi.

* between'de iki tane sınır değeri giriyoruz ve belirli bir değişkende (veya tüm dataframe'de) bu değerlerin arasında kalan değerler TRUE olarak döndürülüyor.

* İstenildiği taktirde değer aralığına sınır değerlerinin de dahil edilmesi sağlanabilir. Hatta dahil edilmemeleri veya sınır değerlerinden sadece birisinin dahil edilmesi seçeneği de kullanılabilir.  


* **inclusive = "both"**; sınır değerlerinin ikisi de dahil edilir.***(Default)***
* **inclusive = "neither"**; sınır değerlerinin ikisi de dahil edilmez.
* **inclusive = "left"**; sınır değerlerinden sadece soldaki dahil edilir.
* **inclusive = "rigth"**; sınır değerlerinden sadece sağdaki edilir.

In [197]:
df = pd.read_csv("train.csv")

In [200]:
df.Age.between(3,10)

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [201]:
df.Age.between(3,10, inclusive="neither")

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [203]:
df[df.Age.between(3,10, inclusive="neither")].head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.000,1,1,PP 9549,16.700,G6,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.000,3,1,349909,21.075,NaN,S
50,51,0,3,"Panula, Master. Juha Niilo",male,7.000,4,1,3101295,39.688,NaN,S
58,59,1,2,"West, Miss. Constance Mirium",female,5.000,1,2,C.A. 34651,27.750,NaN,S
63,64,0,3,"Skoog, Master. Harald",male,4.000,3,2,347088,27.900,NaN,S

### query()

* Basit anlaşılır query cümleleriyle slicing yapılabilir.

In [96]:
df = pd.read_csv("train.csv")

In [97]:
df.query("Age >= 70 and Sex=='male'")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.000,0,0,PC 17754,34.654,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.500,0,0,370369,7.750,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.000,0,0,PC 17609,49.504,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.000,0,0,27042,30.000,A23,S
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.000,0,0,C.A. 24580,10.500,NaN,S
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.000,1,1,WE/P 5735,71.000,B22,S
851,852,0,3,"Svensson, Mr. Johan",male,74.000,0,0,347060,7.775,NaN,S

### str.contains() ve *Regex* ile - Bir kelimeyi ya da bir karakteri bulma
* Herhangi bir şeyi aratabilirsin.
* Aradığın şey tam tamına dataframe'deki değerlerle eşit olmasa da olur.
* Bir kelimenin sadece bir kısmını yazman da yeterli. Bu kısım ister başta ister sonda ister ortada isterse daha başka bir yerde olsun hiç farketmez.

In [129]:
df = pd.read_csv("train.csv")

In [130]:
df[df["Name"].str.contains("Mich")]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
148,149,0,2,"Navratil, Mr. Michel (""Louis M Hoffman"")",male,36.500,0,2,230080,26.000,F2,S
193,194,1,2,"Navratil, Master. Michel M",male,3.000,1,1,230080,26.000,F2,S
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.000,0,0,C.A. 24580,10.500,NaN,S
718,719,0,3,"McEvoy, Mr. Michael",male,NaN,0,0,36568,15.500,NaN,Q
749,750,0,3,"Connaghton, Mr. Michael",male,31.000,0,0,335097,7.750,NaN,Q

In [131]:
# Regex kullanarak daha komplike aramalar yapabilirsin
# Aşağıdaki ifade içinde "mich" veya "abr" bulunan isimleri getirecektir.
# "flags= re.I" ifadesi büyük küçük harfi önemsemeden aramanın yapılmasını sağlamaktadır.
import re
df[df["Name"].str.contains("mich|abr", flags= re.I, regex= True)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
148,149,0,2,"Navratil, Mr. Michel (""Louis M Hoffman"")",male,36.500,0,2,230080,26.000,F2,S
193,194,1,2,"Navratil, Master. Michel M",male,3.000,1,1,230080,26.000,F2,S
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.000,0,0,C.A. 24580,10.500,NaN,S
718,719,0,3,"McEvoy, Mr. Michael",male,NaN,0,0,36568,15.500,NaN,Q
749,750,0,3,"Connaghton, Mr. Michael",male,31.000,0,0,335097,7.750,NaN,Q
785,786,0,3,"Harmer, Mr. Abraham (David Lishin)",male,25.000,0,0,374887,7.250,NaN,S
824,825,0,3,"Panula, Master. Urho Abraham",male,2.000,4,1,3101295,39.688,NaN,S

In [132]:
# Şimdi yine Regex ile daha komplike bir şeyler deneyelim

# Aşağıdaki ifade "mu" ile başlayan kayıtları getirir.
df[df["Name"].str.contains("^mu", flags= re.I, regex= True)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
241,242,1,3,"Murphy, Miss. Katherine ""Kate""",female,NaN,1,0,367230,15.500,NaN,Q
589,590,0,3,"Murdlin, Mr. Joseph",male,NaN,0,0,A./5. 3235,8.050,NaN,S
612,613,1,3,"Murphy, Miss. Margaret Jane",female,NaN,1,0,367230,15.500,NaN,Q
697,698,1,3,"Mullens, Miss. Katherine ""Katie""",female,NaN,0,0,35852,7.733,NaN,Q
841,842,0,2,"Mudd, Mr. Thomas Charles",male,16.000,0,0,S.O./P.P. 3,10.500,NaN,S

### Pandas SQL Yöntemi

* Bu library'yi kullanarak standard sql ifadeleriyle verisetinden istediğin gözlemlere ulaşabilirsin

In [99]:
import pandasql as ps

df = pd.read_csv("train.csv")

In [101]:
ps.sqldf('''SELECT Pclass, Embarked, Name FROM df
            WHERE Embarked = 'S' and Age<=20
            ORDER BY Name DESC;''')

     Pclass Embarked                                  Name
0         3        S             de Pelsmaeker, Mr. Alfons
1         3        S             Wiklund, Mr. Jakob Alfred
2         2        S          West, Miss. Constance Mirium
3         2        S                     Wells, Miss. Joan
4         3        S  Vestrom, Miss. Hulda Amanda Adolfina
..      ...      ...                                   ...
132       1        S          Allison, Miss. Helen Loraine
133       1        S        Allison, Master. Hudson Trevor
134       3        S           Alhomaki, Mr. Ilmari Rudolf
135       3        S            Aks, Mrs. Sam (Leah Rosen)
136       3        S           Abbott, Mr. Rossmore Edward

[137 rows x 3 columns]

## EDIT Dataframe (İsim değiştirme, Silme, Ekleme, Birleştirme, Değer değiştirme...)

### rename() / Kolon-Index ismi değiştirme

In [102]:
df = pd.read_csv("train.csv")

In [103]:
df.rename(columns={"Survived":"Kurtuldu", "Sex":"Cinsiyet", "Pclass":"Yolcu_Sınıfı"}, inplace=True)
df.columns

Index(['PassengerId', 'Kurtuldu', 'Yolcu_Sınıfı', 'Name', 'Cinsiyet', 'Age',
       'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

### drop(), pop() ve del / Silme işlemleri

#### drop()

* **drop=** , Bu fonksiyonla hem index hem kolonları silebilirsin, inplace parametresini kullanarak silme işleminin kaydedilmesini sağlayabilirsin.

In [105]:
df = pd.read_csv("train.csv")

In [106]:
df.drop("Embarked", axis=1, inplace=True)

In [ ]:
# Birden çok kolon silmek istenildiğinde
df.drop(["Age","Name"], axis=1, inplace=True)

#### pop()

* **pop=** , Bu fonksiyon kolonları silmede kullanılıyor. Ancak bir defada sadece bir kolon silinebiliyor.

* Yapılan işlem direkt kaydediliyor.

In [123]:
df = pd.read_csv("train.csv")

In [127]:
df.pop("Age")

0     22.000
1     38.000
2     26.000
3     35.000
4     35.000
       ...
886   27.000
887   19.000
888      NaN
889   26.000
890   32.000
Name: Age, Length: 891, dtype: float64

In [128]:
df

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.250,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.283,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.100,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.050,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,0,0,211536,13.000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,0,0,112053,30.000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,1,2,W./C. 6607,23.450,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,0,0,111369,30.000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,0,0,370376,7.750,NaN,Q

#### del

* **del**, bana göre en temiz yöntem. Bu fonksiyon ile sildiğiniz şeyler kesin olarak kaydedilir ve geri dönülemez. Bu yöntemle Dataframe'in kendisini de komple silebilirsin.

In [121]:
df = pd.read_csv("train.csv")

In [122]:
del df["Pclass"]

### append() ve insert() / Ekleme

#### append()
* Bu fonksiyon row/satır eklemeye yarar. Dataframe'in en altına belirtilen bir satırı veya bir grup satırı veya başka bir Dataframe'i ekler.  

* **ignore_index=True** parametresini kullanırsan index'leri tekrar düzenler.  

* Yapılan işlemin kaydedilmesi için yazılan kodun Dataframe nesnesinin kendisine eşitlenmesi gerekiyor. Maalesef Inplace gibi bir parametre bulunmuyor.

In [111]:
df = pd.read_csv("train.csv")
df1 = df.copy()

In [ ]:
df.append(df1, ignore_index=True)

In [112]:
# Kendin manuel olarak da veri ekleyebilirsin.
df = df.append({"Name":"YATTTARA", "Sex":"male","Age":500}, ignore_index=True)
df.tail(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
887,888.000,1.000,1.000,"Graham, Miss. Margaret Edith",female,19.000,0.000,0.000,112053,30.000,B42,S
888,889.000,0.000,3.000,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.000,2.000,W./C. 6607,23.450,NaN,S
889,890.000,1.000,1.000,"Behr, Mr. Karl Howell",male,26.000,0.000,0.000,111369,30.000,C148,C
890,891.000,0.000,3.000,"Dooley, Mr. Patrick",male,32.000,0.000,0.000,370376,7.750,NaN,Q
891,NaN,NaN,NaN,YATTTARA,male,500.000,NaN,NaN,NaN,NaN,NaN,NaN

#### insert()
* append'in aksine insert komutuyla Dataframe'e kolon girilmesinde kullanılır.

* Çok kullanışlı bir fonksiyon. Dataframe'deki istediğiniz yere istediğiniz bir kolonu ekleyebilirsiniz.

* Eklenecek kolonun isminin ve değerlerinin ne olduğunu da belirtebilirsiniz.

*Bildiğimi kadarıyla birden fazla kolon eklemesi yapamıyoruz, belki ben yanlış anlamış da olabilirim*

In [113]:
df = pd.read_csv("train.csv")

In [114]:
df.insert(loc=2, column="random", value=np.random.randint(0,50,891))

In [116]:
df.head(5)

,PassengerId,Survived,random,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,32,3,"Braund, Mr. Owen Harris",male,22.000,1,0,A/5 21171,7.250,NaN,S
1,2,1,12,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000,1,0,PC 17599,71.283,C85,C
2,3,1,20,3,"Heikkinen, Miss. Laina",female,26.000,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,5,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000,1,0,113803,53.100,C123,S
4,5,0,8,3,"Allen, Mr. William Henry",male,35.000,0,0,373450,8.050,NaN,S

### concat() / Birleştirme

* Hem kolon hem satır eklemede kullanılabilecek bir fonksiyondur.

* Satır ekleneceği zaman **axis=0**, kolon ekleneceği zaman **axis=1** parametreleri girilir.

* **ignore_index=True** parametresiyle de **satır eklemesi yapıldığında** index numaralarının tekrar düzgün bir şekilde sıralanması sağlanabilir.

In [117]:
df = pd.read_csv("train.csv")
dfcopy = df.copy()

In [143]:
df2 = pd.concat([df,dfcopy], axis=1)

### Conditional yöntem, replace(), apply(), map() / Gözlemlerin Değerlerini Değiştirme

#### Conditional Yöntem

* Nedendir bilinmez, bu tekniği kullanırken ilk kolonun ismini condition kısmına girmeye dikkat et, eğer sonradan girersen işlem işlevini görmeyebiliyor.

In [144]:
df = pd.read_csv("train.csv")

In [145]:
df["Age"][(df.Age > 70) & (df.Sex=="male")] = "yasli adam"

In [147]:
df[df.Age=="yasli adam"]["Age"]

96     yasli adam
116    yasli adam
493    yasli adam
630    yasli adam
851    yasli adam
Name: Age, dtype: object

#### replace()

In [167]:
df = pd.read_csv("train.csv")

In [168]:
df1= df.copy()
df1.Sex.replace(["male","female"],[0,1],inplace=True)
df1["Sex"].head(5)

0    0
1    1
2    1
3    1
4    0
Name: Sex, dtype: int64

In [169]:
#regex kullanarak string'lerin içinde spesifik karakterleri değiştirebilirsin.
df1 = df.copy()
df1.Sex.replace("a","Z", regex=True).head(5)

0      mZle
1    femZle
2    femZle
3    femZle
4      mZle
Name: Sex, dtype: object

In [174]:
# Bir defada birden fazla kolonda replace() işlemini yapabilirsin. Kolonları ve değerleri de seçebilirsin.
df1 = df.copy()
df1.replace({"Age":{22: 2222 , 38:3888}, "Sex":{"male": "ERKEK"}}, inplace= True)
df1.head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",ERKEK,2222.000,1,0,A/5 21171,7.250,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,3888.000,1,0,PC 17599,71.283,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000,1,0,113803,53.100,C123,S

#### map()

In [175]:
df = pd.read_csv("train.csv")

In [176]:
df["Sex"] = df.Sex.map({"male":"erkek","female":"kadın"})
df["Sex"]

0      erkek
1      kadın
2      kadın
3      kadın
4      erkek
       ...
886    erkek
887    kadın
888    kadın
889    erkek
890    erkek
Name: Sex, Length: 891, dtype: object

#### apply()

In [177]:
df = pd.read_csv("train.csv")

In [178]:
df["Age"]= df.Age.apply(lambda x: np.sqrt(x))
df["Age"]

0     4.690
1     6.164
2     5.099
3     5.916
4     5.916
       ...
886   5.196
887   4.359
888     NaN
889   5.099
890   5.657
Name: Age, Length: 891, dtype: float64

### factorize()

* Kategorik verilere label encoding uygulamak için kullanılan pandas'ın bize sunduğu basit bir fonksiyon.
* Yalnız encoding işleminde ilk gördüğü veriye 0 veriyor. Ben 2'den fazla kategorik sınıf içeren değişkenlerde sınıflardan birisinin 0 olarak nitelendirilmesinden kaynaklanan bazı problemler gördüm. **Bu nedenle bu yöntemi aslında pek de önermiyorum, mümkünse 2'den fazla sınıf içeren kategorik değişkenlerde başka yöntemler kullan ve sınıflara 0 değerini verme. Çünkü algoritmalar 0 değerini sanki hiç yokmuş gibi algılayabiliyor.**

In [385]:
df = pd.read_csv("train.csv")

In [387]:
df["Sex"] = pd.factorize(df["Sex"])[0]
df["Sex"]

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    1
889    0
890    0
Name: Sex, Length: 891, dtype: int64

### clip()

* **clip**; değerleri kırpmaya yarayan kullanışlı bir fonksiyondur. Kırpmaktan kastedilen, değerlerin verilen sınır değerlerinden büyük/küçük olması durumunda sınır değerlerine eşitlenmesidir.


* İstersen 2 sınır değeri verebilirsin, istersen de "şu değerden büyükleri kırp" veya "şu değerden küçükleri kırp" diyebilirsin.


* Yapılan işlem kaydedilmez. Bunun için **inplace=True** parametresini kullanabilirsin.

In [240]:
df = pd.read_csv("train.csv")

In [241]:
df.Age.clip(10,50)

0     22.000
1     38.000
2     26.000
3     35.000
4     35.000
       ...
886   27.000
887   19.000
888      NaN
889   26.000
890   32.000
Name: Age, Length: 891, dtype: float64

In [242]:
# Sadece 20'den küçük değerleri 20'ye eşitleyecektir ve işlemin kaydedilmesini sağlayacaktır.
df.Age.clip(lower=20, inplace=True)

### where()

* Değerleri değiştirmede kullanılabilen alternatif bir fonksiyondur.

* Yapılan işlem kaydedilmez, bu nedenle işlemi bir nesneye eşitlemek gereklidir.

In [245]:
np.where(df["Cabin"].isna(),1,0)

array([1, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0,
       1, 0, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1,
       0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       0, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1,
       0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1,
       1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 0, 1,
       1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1,
       1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 0,
       1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1,
       1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 1, 0, 1, 0,
       1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0,
       1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0,
       1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1,
       1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1,
       1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1,
       0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1,
       0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0,
       1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0,
       1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1,
       0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0,
       0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1,
       1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1,
       1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1,
       1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0,
       1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0,
       1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1,
       1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1,
       1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1,
       0, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1,
       1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1,
       1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1,
       1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0,
       1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 0,
       1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 0,
       1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1])

### mask()

* **cond=**, bu parametreye değiştirmeyi istediğin değerlerin condition bilgisini yazıyorsun
* **other=**, bu parametreye ise değiştirmeyi istediğin gözlemlerin yeni değerinin ne olması gerektiğini yazıyorsun.

In [259]:
df = pd.read_csv("train.csv")

In [260]:
df.Age.mask(cond=df.Age.between(0,10), other="çocuk", inplace=True)

## astype() / Convert dtype, Veri tipi değişme

In [120]:
df.Age = df.Age.astype(str)
df.Age.dtype

dtype('O')

## assign() / Yeni değişken oluşturmanın kolay yolu

* Bu fonksiyon ile Dataframe'de yeni bir kolon oluşturulabilir ve bunu kısaca yazabilirsin  


* Fonksiyon işlemi kendiliğinden kaydetmiyor, o nedenle dataframe nesnesine eşitlemen gerekecetir. 


* kaynak: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.assign.html

In [339]:
df = pd.read_csv("train.csv")

In [341]:
# ben rastgele Age/Fare oranıyla bir değişken oluşturacağım.

df = df.assign(AgeFare= df.Age/df.Fare)
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,AgeFare
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000,1,0,A/5 21171,7.250,NaN,S,3.034
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000,1,0,PC 17599,71.283,C85,C,0.533
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000,0,0,STON/O2. 3101282,7.925,NaN,S,3.281
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000,1,0,113803,53.100,C123,S,0.659
4,5,0,3,"Allen, Mr. William Henry",male,35.000,0,0,373450,8.050,NaN,S,4.348

## join ve merge

* join ve merge aslında aynı işi yapıyorlar ama benim anladığım kadarıyla join'de iki dataframe'i join edecek değişkenin iki değişkende de aynı isimde olması gerekiyor. Merge'de ise dataframe'lerdeki değişkenlerin isimleri farklı olabilir, bu durumlarda merge kullanmak gerekiyor.  

**join:** https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.join.html


**merge:** https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html

## groupby fonksiyonu

* Groupby fonksiyonuyla aggregate fonksiyonlar olan count, max, min, sum, mean, median, mode, std gibi istatistiksel fonksiyonları kullanabilirsin.

In [179]:
df = pd.read_csv("train.csv")

In [180]:
df.groupby("Pclass")["Survived"].mean()

Pclass
1   0.630
2   0.473
3   0.242
Name: Survived, dtype: float64

In [181]:
df.groupby(["Pclass","Sex"])["Survived"].mean()

Pclass  Sex
1       female   0.968
        male     0.369
2       female   0.921
        male     0.157
3       female   0.500
        male     0.135
Name: Survived, dtype: float64

In [182]:
df.groupby(["Pclass","Sex"])["Survived"].agg("mean")

Pclass  Sex
1       female   0.968
        male     0.369
2       female   0.921
        male     0.157
3       female   0.500
        male     0.135
Name: Survived, dtype: float64

## Pivot table

In [184]:
df = pd.read_csv("train.csv")

In [185]:
pd.pivot_table(df, index="Embarked").T

Embarked          C       Q       S
Age          30.815  28.089  29.445
Fare         59.954  13.276  27.080
Parch         0.363   0.169   0.413
PassengerId 445.357 417.896 449.528
Pclass        1.887   2.909   2.351
SibSp         0.387   0.429   0.571
Survived      0.554   0.390   0.337

In [186]:
pd.pivot_table(df, index="Embarked",aggfunc="median",values=["Age","Fare"])

            Age   Fare
Embarked
C        29.000 29.700
Q        27.000  7.750
S        28.000 13.000

In [187]:
pd.pivot_table(df, index="Embarked",aggfunc="mean",values=["Age","Fare","Survived"],columns=["Pclass"]).T

Embarked              C      Q      S
         Pclass
Age      1       38.027 38.500 38.152
         2       22.767 43.500 30.387
         3       20.742 25.938 25.697
Fare     1      104.719 90.000 70.365
         2       25.358 12.350 20.327
         3       11.214 11.183 14.644
Survived 1        0.694  0.500  0.583
         2        0.529  0.667  0.463
         3        0.379  0.375  0.190

## PIPE FONKSIYONU / Pandas Pipeline kurma

* **pipe**, bence Pandas'daki en şık fonksiyon. Adından da belli olduğu üzere bir pipeline'mış gibi çalışıyor.


* Birden çok fonksiyonu aynı kod satırı içinde çalıştırssbiliyorsun. Tabi çalıştırdığın fonksiyonlar kendi tanımladıkların oluyor genelde.  


**kaynak:** https://towardsdatascience.com/using-pandas-pipe-function-to-improve-code-readability-96d66abfaf8

In [377]:
df = pd.read_csv("train.csv")

In [378]:
# Örnek iki tane fonksiyon yazalım

def deneme1(df, col_list):
    for col in col_list:
        df[col] =  df[col]**4
    return df

def deneme2(df,col_list):
    for col in col_list:
        df[col] = "Deneme!!!"
    return df

In [379]:
dfx = (df.pipe(deneme1, ["Age","Fare"])
.pipe(deneme2,["Name","PassengerId"]))

dfx.head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,Deneme!!!,0,3,Deneme!!!,male,234256.000,1,0,A/5 21171,2762.816,NaN,S
1,Deneme!!!,1,1,Deneme!!!,female,2085136.000,1,0,PC 17599,25819699.719,C85,C
2,Deneme!!!,1,3,Deneme!!!,female,456976.000,0,0,STON/O2. 3101282,3944.547,NaN,S
3,Deneme!!!,1,1,Deneme!!!,female,1500625.000,1,0,113803,7950200.552,C123,S

## Tarih Verilerinin Manipülasyonu

* Pandas'ın tarih verilerine müdahale etmede büyük kolaylık sağlayan fonksiyonları var.


* Verinizdeki tarihin yazılış şekli ne kadar bozuk olursa olsun doğru bir şekilde veriyi düzenleme fırsatına sahipsiniz.  


* Ayrıca belirli bir tarihten belirli bilgileri çıkartabilme özelliği de vardır. Örneğin o tarihteki günün ismi, o tarihin yılın kaçıncı haftasında olduğu gibi ve benzeri bilgiler.

* Tarih formatlamada kullanılan abbreviation'lar için şu websitesine bakın: https://pandas.pydata.org/docs/reference/api/pandas.Period.strftime.html  


* Tarih bilgileri için kullanılan kısa fonksiyonların bazıları aşağıda verilmiştir.
![](pandas_datetime_funcs.png)

In [188]:
tarih = pd.read_excel("date_example.xlsx")
tarih

           dates
0     April-2021
1       May-2019
2   October-1990
3     March-1991
4    August-2009
5  December-2012

In [193]:
 tarih = pd.to_datetime(tarih['dates'],format='%B-%Y')

In [196]:
# 0=Pazartesi, 6=Pazar olacak şekilde günlerin sıra sayısını veren örnek bir gösterim
tarih.dt.weekday

0    3
1    2
2    0
3    4
4    5
5    5
Name: dates, dtype: int64

# Misc. Useful Codes

## List in List

### Case1: Bir listedeki elemanların tümü başka bir listenin içinde de var mı?

* Bize bunun kontrolünü yapan ve sonuca göre True/False şeklinde bir cevap gönderen bir kod bloğu aşağıdadır.

kaynak: https://www.techbeamers.com/program-python-list-contains-elements/

In [343]:
# Program to check the list contains elements of another list

# List1
List1 = ['python' ,  'javascript', 'csharp', 'go', 'c', 'c++']
 
# List2
List2 = ['csharp' , 'go', 'python']

check =  all(item in List1 for item in List2)
 
if check is True:
    print("The list {} contains all elements of the list {}".format(List1, List2))    
else :
    print("No, List1 doesn't have all elements of the List2.")

The list ['python', 'javascript', 'csharp', 'go', 'c', 'c++'] contains all elements of the list ['csharp', 'go', 'python']

### Case2: Bir listedeki herhangi bir eleman diğer bir listenin içinde bulunuyor mu? Kısacası iki listenin ortak elemanı var mı?

* Burada any() fonksiyonundan yararlanılabilir.  

* Ayrıca set yapılarının kullanılması da çok etkili olabilir. Set'lerdeki kesişim özelliği kesinlikle yardımcı olacaktır.

kaynak: https://www.techbeamers.com/program-python-list-contains-elements/

In [344]:
# Program to check the list contains elements of another list

# List1
List1 = ['python' ,  'javascript', 'csharp', 'go', 'c', 'c++']
 
# List2
List2 = ['swift' , 'php', 'python']

check =  any(item in List1 for item in List2)
 
if check is True:
    print("The list {} contains some elements of the list {}".format(List1, List2))    
else :
    print("No, List1 doesn't have any elements of the List2.")

The list ['python', 'javascript', 'csharp', 'go', 'c', 'c++'] contains some elements of the list ['swift', 'php', 'python']

### Bir klasördeki dosya isimlerini listeleme;
* Kaynak; https://www.geeksforgeeks.org/how-to-use-glob-function-to-find-files-recursively-in-python/

In [ ]:
import glob

In [ ]:
# mevcut çalışma klasöründeki txt dosyaları için;
'''txtfiles = []
for file in glob.glob("*.txt"):
    txtfiles.append(file)'''

In [ ]:
'''txtfiles1 = []
for file in glob.glob("/home/geeks/Desktop/gfg/*.txt"):
    txtfiles1.append(file)'''

### Bir String'den istenilen kelimeleri atma
* Kaynak: https://stackoverflow.com/questions/25346058/removing-list-of-words-from-a-string

In [384]:
query = 'What is hello, explain me!'
stopwords = ['what', 'who', 'is', 'a', 'at', 'is', 'he']
querywords = query.split()

resultwords  = [word for word in querywords if word.lower() not in stopwords]
result = ' '.join(resultwords)

print(result)

hello, explain me!